#+BEGIN_COMMENT
.. title: NER: Data
.. slug: ner-data
.. date: 2021-01-13 15:00:14 UTC-08:00
.. tags: lstm,rnn,nlp,ner
.. category: NLP
.. link: 
.. description: Loading the data for the NER model.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-709fde8b-8b91-427d-957f-760d2020bb80-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** Reviewing The Dataset
As a review we can look at what's in the vocabulary.

#+begin_src python :results output :exports both
print(vocabulary["the"])
print(vocabulary[TOKEN.pad])
print(vocabulary["The"])
#+end_src

#+RESULTS:
: 9
: 35178
: 61

The vocabulary maps words in our vocabulary to unique integers. As you can see, we made it case-sensitive.

We also made a map for tags.

#+begin_src python :results output :exports both
for tag, index in tags.items():
    print(f" - {tag}: {index}")
#+end_src

#+RESULTS:
#+begin_example
 - O: 0
 - B-geo: 1
 - B-gpe: 2
 - B-per: 3
 - I-geo: 4
 - B-org: 5
 - I-org: 6
 - B-tim: 7
 - B-art: 8
 - I-art: 9
 - I-per: 10
 - I-gpe: 11
 - I-tim: 12
 - B-nat: 13
 - B-eve: 14
 - I-eve: 15
 - I-nat: 16
 - UNK: 17
#+end_example

| Prefix | Interpretation            |
|--------+---------------------------|
| B      | Token Begins an entity    |
| I      | Token is Inside an entity |

This is to help when you have multi-token entities. So if you had the name "Burt Reynolds", "Burt" would be tagged =B-per= and "Reynolds" would be tagged "I-per".

#+begin_src python :results output :exports both
print(f"The number of tags is {len(tag_map)}")
print(f"The vocabulary size is {len(vocab):,}")
print(f"The training size is {len(ner.data.data_sets.x_train):,}")
print(f"The validation size is {len(ner.data.data_sets.x_validate):,}")
print("The first training sentence is ")
print(f"'{' '.join(ner.data.raw_data_sets.x_train[0])}'")
print("Its corresponding label is")
print(f" '{' '.join(ner.data.raw_data_sets.y_train[0])}'")

print("The first training encoded sentence is ")
print(f"{ner.data.data_sets.x_train[0]}")
print("Its corresponding encoded label is")
print(f"{ner.data.data_sets.y_train[0]}")
#+end_src

#+RESULTS:
#+begin_example
The number of tags is 18
The vocabulary size is 35,180
The training size is 33,570
The validation size is 7,194
The first training sentence is 
'Opposition leader Michael Howard said he hopes the government in coming weeks will try to uncover possible security flaws exploited in the attacks .'
Its corresponding label is
 'O O B-per I-per O O O O O O O O O O O O O O O O O O O O'
The first training encoded sentence is 
[7848, 538, 5951, 6187, 172, 502, 2453, 9, 293, 11, 5306, 822, 141, 1962, 7, 26689, 1176, 686, 11905, 14806, 11, 9, 292, 21]
Its corresponding encoded label is
[0, 0, 3, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
#+end_example
